% --------------------------------------------------------------------------------------------------------------
% 此函数的作用：计算两幅图像的峰值信噪比
% 版本：v1.0
% 最后编辑者：WangMian
% 最后编辑时间：2016-03-25 16:15
% 传入参数:
%               image1:     第一幅图像的矩阵
%               image2:     第二幅图像的矩阵
%               bitdepth:    图像每通道的位深度
% 返回参数：
%               PSNR:       图像的峰值信噪比
% 说明：        两幅图像的每通道的位深度需一样
% --------------------------------------------------------------------------------------------------------------
function [PSNR]=getPsnr(image1,image2,bitdepth)
MAXI=2^bitdepth-1;
mtr=im2uint8(image1)-im2uint8(image2);
[m,n]=size(mtr);
MSE=sum(sum(mtr.^2))/(m*n);
PSNR=10*log10(MAXI^2/MSE);