% --------------------------------------------------------------------------------------------------------------
% 此函数的作用：根据最小欧几里得距离来提取水印信息比特
% 版本: v1.0
% 最后编辑者：WangMian
% 最后编辑时间：2016-03-25 16:38
% 传入参数：
%               z1:     lx和ly的比值;
%               delta: 量化步长;
% 返回参数：
%               m1:     提取到的信息比特（0或1）
% --------------------------------------------------------------------------------------------------------------
function [m1] = minEucDistance(z1, delta)
q00 = quantificate(z1, 0, delta);
q10 = quantificate(z1, 1, delta);
[~, pos] = min(abs(z1 - [q00, q10]));
if pos == 1
    m1 = 0;
else
    m1 = 1;
end;