% --------------------------------------------------------------------------------------------------------------
% 此函数的作用：量化
% 版本：v1.0
% 最后编辑者：WangMian
% 最后编辑时间：2016-03-25 16:42
% 传入参数: 
%               z:        lx和ly（范数）的比值;
%               m:      水印信息比特， 0 or 1. (m= data(i));
%               delta: 量化步长
% 返回参数：
%               z1：量化值
% --------------------------------------------------------------------------------------------------------------
function [z1] = quantificate(z, m, delta)
dither = m*delta/2;
z1 = delta * round((z + dither) / delta) - dither;
